# კომენტარის სახით ახსენით თუ რა არის სია და რაშივიყენებთ მას,ასევე ახსენი თუ რით განსხვავდება იგი ცვლადისგან

#სიაში შეგვიძლია შევინახოტ რამდენი და როგორი ტიპის ელემენტიც გვინდა. 
#სია რომ შევქმნათ ცვლადში უნდა ჩავწეროთ "[]"".
# მაგ: 
sia = ["hi", 3,5, 9, True]

#ასევე შეგვიძლია სიაში მოვათავსოთ მეორე სიაც, კვადრატულ ფრჩხილებში მეორე კვადრატული ფრჩხილების მოთავსებით:
sia = [3,5, True, "hi", 9, ["mariam", "philishvili", 14]]

#ცვლადში ვერ შევინახავთ რამოდენიმე ელემენტს, გვაქვს მხოლოდ ერთი მნიშვნელობის შენახვის უფლება. 
# ხოლო სიაში შეგვიძლია რამოდენიმე ტიპის ელემენტის და მნიშვნელობის შეტანა.
