# 1.Sequence—კომპიუტერი ასრულებს ბრძანებებს რიგრიგობით,პირველის შემდეგ მეორეს.
#    ანუ რაც ზემოთ წერია, ის პირველი კეთდება.
#    მაგ:
#    print("პირველი")
#    print("მეორე")
#    ჯერ დაიბეჭდება "პირველი", მერე "მეორე"
# 2.Iteration—როცა რაღაც ბევრჯერ მეორდება.
#    მაგალითად როცა გვინდა ერთიდაიგივე ტექსტი 5-ჯერ დაიბეჭდოს.
#    მაგ:
for i in range(5):
    print("mariam")
# 3. Selection—როცა კომპიუტერი არჩევანს აკეთებს
#    ანუ თუ რაღაც ჭეშმარიტია (true), ერთი რამ გააკეთოს, თუ არადა სხვა.
#    მაგ:
age = 18
if age >= 18:
    print("შენ სრულწლოვანი ხარ")
else:
    print("შენ არასრულწლოვანი ხარ")
